<template>
  <div id="context">
  <p><h3 style="text-align: center">云顶之弈冷知识一览</h3><br/>

      一：元素使和法师一样拥有双倍的普攻基础回蓝
      <br/>
      但是并不能和法师叠加，元素使变成法师回蓝不变
      <br/>
      二： 英雄一星时回蓝只有正常水平的66%
      <br/>
      举例，法师普攻回蓝20，但是一星时两次普攻回蓝30
      <br/>
      二星三星时两次普攻回蓝40 ,后来作者也找到了设计师的推特，证实了这点，设计师原文是，一星棋子最高不超过10，最低不低于6，也就是7-9之间。
      <br/>
      三：飓风和飓风可以互相触发
      <br/>
      一个飓风1支箭，2个飓风4支箭，3个飓风9支箭，这个版本飓风的伤害从25%提升到了75%，这个效果可能属于bug，但是并没有被修复。这个特殊的效果是作者首先发现的哦!并且做了各种特效英雄的测试vn 维鲁斯 卡萨丁 寒冰，最终发现，双飓风寒冰，可以100%胜利。不过，很难成型，没有铲子请不要强行尝试。
      <br/>
      ps：下个版本此bug仍未修复，且恶魔攻击改为偷取蓝量，并且飓风可以触发，那么，恶魔火男，是不是一秒一R了，满天火球?
      <br/>
      四：攻击特效分攻击动作特效和攻击命中后效
      <br/>
      可能会有小伙伴听不懂，说简单点，有些特效是通过攻击动作触发的(普攻回蓝，电刃，回蓝刀)，在攻击命中之前，有些特效是通过命中触发的(诅咒之刃，缴械)，在攻击命中之后，不过枪手的攻击是个例外(可以触发普攻回蓝，但是不能触发电刃)，这个冷知识的用途就是，不要以为飓风能触发回蓝刀和电刃了。 另外英雄的攻击被闪避的情况下一样能触发回蓝。
      <br/>
      五：元素使召唤的小菊总是在随机一个元素使的身边
      <br/>
      如果不想让小菊站在你后面，就把元素使当前排吧。
      <br/>
      六：暗影的技能竟然不是随机的。
      <br/>
      最好的防止c位被秒的方式是，主要棋子放在一侧，另一侧单独放一个送死的。次要棋子包围C位棋子。
      <br/>
      七：护卫的buff是可以无限叠加的
      <br/>
      (曾经有一个无敌套路就是护卫龙，可惜现在被虚空斗法制裁了)
      <br/>
      八：法强不能为增加攻击力或者攻击速度的技能提供加成
      <br/>
      也不能为德莱文的技能提供加成。相关的有豹子，龙女，纳尔，狮子。
      <br/>
      九：帽子的效果是增加已有法强的50%
      <br/>
      官方的描述有错误，事实上云顶之弈的帽子和召唤师峡谷的帽子 是一样的原理，都是增加已有法强，但是云顶的帽子可以叠加，如果给6法死歌出三个帽子，那伤害就是220*1.5*1.5*1.5=742.5 法强 再用7.425*700+700(二星伤害)=5897.5 秒天秒地秒空气。
      <br/>
      十：重头戏来了，飓风可以触发剑士的特效，双飓风5支箭，97%的概率触发连击。</p>
  </div>
</template>

<script>
    export default {
        name: "detail"
    }
</script>

<style scoped>
  #context {
    width: 700px;
    margin: 0 auto;
    line-height: 29px;
    text-align: left;
  }
</style>
